let S = [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22, 23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67];
S[0] = [47,49,51,53,55,57,59,61,63,65];
S[1] = [112,114,116,118,120,122,124,126,128,130];
S[2] = [112,114,116,118,120,122,124,126,128,130];
S[3] = [112,114,116,118,120,122,124,126,128,130];
S[4] = [77,78,79,80,81,82,83,84,85,86];
S[5] = [41,43,45,47,49,51,53,55,57,58,59];
S[6] = [83,85,87,89,91,93,95,97,99,101];
S[7] = [97,99,101,103,105,107,109,111,113,115];
S[8] = [99,101,103,105,107,109,111,113,115,117];
S[9] = [154,156,158,160,162,164,166,168,170,172];
S[10] = [92,94,96,98,100,102,104,106,108,110];
S[11] = [106,108,110,112,114,116,118,120,122,124];
S[12] = [128,130,132,134,136,138,140,142,144,146];
S[13] = [42,44,46,48,50,52,54,56,58,60];
S[14] = [132,134,136,138,140,142,144,146,148,150];
S[15] = [110,112,114,116,118,120,122,124,126,128];
S[16] = [72,74,76,78,80,82,84,86,88,90];
S[17] = [114,116,118,120,122,124,126,128,130,132];
S[18] = [135,137,139,141,143,145,147,149,151,153];
S[19] = [112,114,116,118,120,122,124,126,128,130];
S[20] = [102,104,106,108,110,112,114,116,118,120];
S[21] = [82,84,86,88,90,92,94,96,98,100];
S[22] = [122,124,126,128,130,132,134,136,138,140];
S[23] = [42,44,46,48,50,52,54,56,58,60];
S[24] = [40,42,44,46,48,50,52,54,56,58];
S[25] = [62,64,66,68,70,72,74,76,78,80];
S[26] = [122,124,126,128,130,132,134,136,138,140];
S[27] = [79,81,83,85,87,89,91,93,95,97,99];
S[28] = [72,74,76,78,80,82,84,86,88,90];
S[29] = [67,69,71,73,75,77,79,81,83,85];
S[30] = [72,74,76,78,80,82,84,86,88,90];
S[31] = [131,133,135,137,139,141,143,145,147,149];
S[32] = [93,95,97,99,101,103,105,107,109];
S[33] = [100,102,104,106,108,110,112,114,116,118];
S[34] = [134,136,138,140,142,144,146,148,150,152];
S[35] = [108,110,112,114,116,118,120,122,124,126];
S[36] = [102,104,106,108,110,112,114,116,118,120];
S[37] = [67,69,71,73,75,77,79,81,83,85];
S[38] = [62,64,66,68,70,72,74,76,78,80];
S[39] = [77,79,81,83,85,87,89,91,93,95];
S[40] = [92,94,96,98,100,102,104,106,108,110];
S[41] = [42,44,46,48,50,52,54,56,58,60];
S[42] = [78,80,82,84,86,88,90,92,94,96];
S[43] = [92,94,96,98,100,102,104,106,108,110];
S[44] = [77,79,81,83,85,87,89,91,93,95];
S[45] = [103,105,107,109,111,113,115,117,119,121];
S[46] = [92,94,96,98,100,102,104,106,108,110];
S[47] = [92,94,96,98,100,102,104,106,108,110];
S[48] = [76,78,80,82,84,86,88,90,92,94];
S[49] = [132,134,136,138,140,14,144,146,148,150];
S[50] = [92,94,96,98,100,102,104,106,108,110];
S[51] = [87,89,91,93,95,97,99,101,103,105];
S[52] = [42,44,46,48,50,52,54,56,58,60];
S[53] = [87,89,91,93,95,97,99,101,103,105];
S[54] = [83,85,87,89,91,93,95,97,99,101];
S[55] = [86,88,90,92,94,96,98,100,102,104];
S[56] = [59,61,63,65,67,69,71,73,75,77];
S[57] = [42,44,46,48,50,52,54,56,58,60];
S[58] = [42,44,46,48,50,52,54,56,58,60];
S[59] = [107,109,111,113,115,117,119,121,123,125];
S[60] = [122,124,126,128,130,132,134,136,138,140];
S[61] = [109,111,113,115,117,119,121,123,125,127];
S[62] = [72,74,76,78,80,82,84,86,88,90];
S[63] = [47,49,51,53,55,57,59,61,63,65];
S[64] = [97,99,101,103,105,107,109,111,113,115];
S[66] = [72,74,76,78,80,82,84,86,88,90];
S[65] = [87,89,91,93,95,97,99,101];
S[66] = [72,74,76,78,80,82,84,86,88,90];
S[67] = [82,84,86,88,90,92,94,96,98,100];
let rotomS = [0,1];
rotomS[0] = [103,105,107,109,111,113,115,117,119,121];
rotomS[1] = [98,100,102,104,106,108,110,112,114,116];
let chaos = 0;
let rotom = [
 {"id": 0, "A": 70, "B": 97, "C": 115, "D": 97, "img1": "../ポケモンクエスト画像/ロトム1.png", "img2": "../ポケモンクエスト画像/ロトム2.png", "img": "../ポケモンクエスト画像/ロトム2.png", "url": "url(../ポケモンクエスト画像/ロトム2.png)", "type": "ゴースト", "color": "#300770", "skill1": 17, "skill2": 32, "skill3": 50, "skill4": 109, "subN": 0},
 {"id": 1, "A": 85, "B": 127, "C": 125, "D": 127, "S": 0, "img1": "../ポケモンクエスト画像/ヒートロトム1.png", "img2": "../ポケモンクエスト画像/ヒートロトム2.png", "img": "../ポケモンクエスト画像/ヒートロトム2.png", "url": "url(../ポケモンクエスト画像/ヒートロトム2.png)", "type": "ほのお", "color": "#FF421C", "skill1": 110, "skill2": 32, "skill3": 17, "skill4": 50, "subN": 1},
 {"id": 2, "A": 85, "B": 127, "C": 125, "D": 127, "S": 0, "img1": "../ポケモンクエスト画像/ウォッシュロトム.png", "img2": "../ポケモンクエスト画像/ウォッシュロトム.png", "img": "../ポケモンクエスト画像/ウォッシュロトム.png", "url": "url(../ポケモンクエスト画像/ウォッシュロトム.png)", "type": "みず", "color": "#028DFF", "skill1": 94, "skill2": 32, "skill3": 17, "skill4": 50, "subN": 1},
 {"id": 3, "A": 85, "B": 127, "C": 125, "D": 127, "S": 0, "img1": "../ポケモンクエスト画像/カットロトム1.png", "img2": "../ポケモンクエスト画像/カットロトム2.png", "img": "../ポケモンクエスト画像/カットロトム1.png", "url": "url(../ポケモンクエスト画像/カットロトム1.png)", "type": "くさ", "color": "#55D600", "skill1": 111, "skill2": 32, "skill3": 17, "skill4": 50, "subN": 1},
 {"id": 4, "A": 85, "B": 127, "C": 125, "D": 127, "S": 0, "img1": "../ポケモンクエスト画像/スピンロトム1.png", "img2": "../ポケモンクエスト画像/スピンロトム2.png", "img": "../ポケモンクエスト画像/スピンロトム2.png", "url": "url(../ポケモンクエスト画像/スピンロトム2.png)", "type": "ひこう", "color": "#ABBFF3", "skill1": 1, "skill2": 32, "skill3": 17, "skill4": 50, "subN": 1},
 {"id": 5, "A": 85, "B": 127, "C": 125, "D": 127, "S": 0, "img1": "../ポケモンクエスト画像/フロストロトム1.png", "img2": "../ポケモンクエスト画像/フロストロトム2.png", "img": "../ポケモンクエスト画像/フロストロトム1.png", "url": "url(../ポケモンクエスト画像/フロストロトム1.png)", "type": "こおり", "color": "#44D3FF", "skill1": 112, "skill2": 32, "skill3": 17, "skill4": 50, "subN": 1},
];
let semiS = [0,1,2,3,4,5,6,7,8,9];
semiS[0] = [112,114,116,118,120,122,124,126,128,130];
semiS[1] = [109,111,113,115,117,119,121,123,125,127];
semiS[2] = [142,144,146,148,150,152,154,156,158,160];
semiS[3] = [107,109,111,113,115,117,119,121,123,125];
semiS[4] = [97,99,101,103,105,107,109,111,113,115];
semiS[5] = [112,114,116,118,120,122,124,126,128,130];
semiS[6] = [147,149,151,153,155,157,159,161,163,165];
semiS[7] = [46,48,50,52,54,56,58,60,62,64];
semiS[8] = [103,105,107,109,111,113,115,117,119,121];
semiS[9] = [212,214,216,218,220,222,224,226,228,230];
semiS[10] = [92,94,96,98,100,102,104,106,108,110];

let semidata = [
 {"id": 0, "name": "イーユイ", "level": 50, "MHP": 130, "HP": 130, "A": 100, "B": 100, "C": 155, "D": 120, "S": 0, "img1": "../準ポケモンクエスト画像/イーユイ1.jpg", "img2": "../準ポケモンクエスト画像/イーユイ2.jpg", "img": "../準ポケモンクエスト画像/イーユイ2.jpg", "bodytype1": "あく", "bodytype2": "ほのお", "skill1": 0, "skill2": 123, "skill3": 126, "skill4": 50, "F": "わざわいのたま", "heavy": 4.9, "color1": "#452222", "color2": "#FF421C", "Fdp": "災厄を呼ぶ勾玉の力で自分以外の特防が弱くなる"},
 {"id": 1, "name": "ウーラオス", "level": 50, "MHP": 175, "HP": 175, "A": 150, "B": 120, "C": 83, "D": 80, "S": 0, "img1": "../準ポケモンクエスト画像/ウーラオス(いちげき)1.jpg", "img2": "../準ポケモンクエスト画像/ウーラオス(いちげき)2.jpg", "img": "../準ポケモンクエスト画像/ウーラオス(いちげき)2.jpg", "bodytype1": "あく", "bodytype2": "かくとう", "skill1": 130, "skill2": 57, "skill3": 39, "skill4": 63, "F": "ふかしのこぶし", "heavy": 105, "color1": "#452222", "color2": "#FF9900", "Fdp": "相手に接触する技なら守りの効果を無視して攻撃することができる", "MAX": null, "MAXimg1": "../準ポケモンクエスト画像/ウーラオス(いちげき)(キョダイマックス)1.jpg", "MAXimg2": "../準ポケモンクエスト画像/ウーラオス(いちげき)(キョダイマックス)2.jpg", "MAXskill1": 26, "MAXskill2": 9, "MAXskill3": 2, "MAXskill4": 0},
 {"id": 2, "name": "カプ・コケコ", "level": 50, "MHP": 145, "HP": 145, "A": 135, "B": 105, "C": 115, "D": 95, "S": 0, "img1": "../準ポケモンクエスト画像/カプコケコ1.png", "img2": "../準ポケモンクエスト画像/カプコケコ2.png", "img": "../準ポケモンクエスト画像/カプコケコ1.png", "bodytype1": "でんき", "bodytype2": "フェアリー", "skill1": 32, "skill2": 95, "skill3": 144, "skill4": 57, "F": "エレキメイカー", "heavy": 20, "color1": "#FFE000", "color2": "#FF58B9", "Fdp": "登場したときにエレキフィールドを張り巡らせる"},
 {"id": 3, "name": "カプ・テテフ", "level": 50, "MHP": 145, "HP": 145, "A": 105, "B": 95, "C": 150, "D": 135, "S": 0, "img1": "../準ポケモンクエスト画像/カプテテフ1.png", "img2": "../準ポケモンクエスト画像/カプテテフ2.png", "img": "../準ポケモンクエスト画像/カプテテフ2.png", "bodytype1": "エスパー", "bodytype2": "フェアリー", "skill1": 126, "skill2": 40, "skill3": 32, "skill4": 17, "F": "サイコメイカー", "heavy": 18, "color1": "#FF8DE8", "color2": "#FF58B9", "Fdp": "登場したときにサイコフィールドを張り巡らせる"},
 {"id": 4, "name": "カプ・レヒレ", "level": 50, "MHP": 145, "HP": 145, "A": 95, "B": 135, "C": 115, "D": 150, "S": 0, "img1": "../準ポケモンクエスト画像/カプレヒレ1.png", "img2": "../準ポケモンクエスト画像/カプレヒレ2.png", "img": "../準ポケモンクエスト画像/カプレヒレ1.png", "bodytype1": "みず", "bodytype2": "フェアリー", "skill1": 40, "skill2": 128, "skill3": 67, "skill4": 129, "F": "ミストメイカー", "heavy": 21, "color1": "#028DFF", "color2": "#FF58B9", "Fdp": "登場したときにミストフィールドを張り巡らせる"},
 {"id": 5, "name": "サンダー", "level": 50, "MHP": 165, "HP": 165, "A": 110, "B": 105, "C": 145, "D": 110, "S": 0, "img1": "../準ポケモンクエスト画像/サンダー1.jpg", "img2": "../準ポケモンクエスト画像/サンダー2.jpg", "img": "../準ポケモンクエスト画像/サンダー2.jpg", "bodytype1": "でんき", "bodytype2": "ひこう", "skill1": 32, "skill2": 34, "skill3": 127, "skill4": 35, "F": "せいでんき", "heavy": 52, "color1": "#FFE000", "color2": "#ABBFF3", "Fdp": "触れた相手を「まひ」状態にすることがある"},
 {"id": 6, "name": "パオジアン", "level": 50, "MHP": 155, "HP": 155, "A": 140, "B": 100, "C": 110, "D": 85, "S": 0, "img1": "../準ポケモンクエスト画像/パオジアン1.jpg", "img2": "../準ポケモンクエスト画像/パオジアン2.jpg", "img": "../準ポケモンクエスト画像/パオジアン2.jpg", "bodytype1": "あく", "bodytype2": "こおり", "skill1": 124, "skill2": 123, "skill3": 125, "skill4": 116, "F": "わざわいのつるぎ", "heavy": 152, "color1": "#452222", "color2": "#44D3FF", "Fdp": "災厄を呼ぶ剣の力で自分以外の防御が弱くなる"},
 {"id": 7, "name": "メルメタル", "level": 50, "MHP": 210, "HP": 210, "A": 163, "B": 163, "C": 100, "D": 85, "S": 0, "img1": "../準ポケモンクエスト画像/メルメタル1.jpg", "img2": "../準ポケモンクエスト画像/メルメタル2.jpg", "img": "../準ポケモンクエスト画像/メルメタル2.jpg", "bodytype1": "はがね", "bodytype2": "null", "skill1": 139, "skill2": 48, "skill3": 11, "skill4": 19, "F": "てつのこぶし", "heavy": 800, "color1": "#999999", "color2": "#FFFFFF", "Fdp": "パンチを使う技の威力が上がる", "MAX": null, "MAXimg1": "../準ポケモンクエスト画像/メルメタル(キョダイマックス)1.png", "MAXimg2": "../準ポケモンクエスト画像/メルメタル(キョダイマックス)2.png", "MAXskill1": 28, "MAXskill2": 14, "MAXskill3": 4, "MAXskill4": 2},
 {"id": 8, "name": "ランドロス", "level": 50, "MHP": 164, "HP": 164, "A": 165, "B": 110, "C": 125, "D": 100, "S": 0, "img1": "../準ポケモンクエスト画像/ランドロス1.jpg", "img2": "../準ポケモンクエスト画像/ランドロス2.jpg", "img": "../準ポケモンクエスト画像/ランドロス2.jpg", "bodytype1": "じめん", "bodytype2": "ひこう", "skill1": 11, "skill2": 93, "skill3": 19, "skill4": 24, "F": "いかく", "heavy": 68, "color1": "#CF9E4E", "color2": "#ABBFF3", "Fdp": "相手の攻撃を下げる"},
 {"id": 9, "name": "レジエレキ", "level": 50, "MHP": 155, "HP": 155, "A": 120, "B": 70, "C": 120, "D": 70, "S": 0, "img1": "../準ポケモンクエスト画像/レジエレキ1.jpg", "img2": "../準ポケモンクエスト画像/レジエレキ2.jpg", "img": "../準ポケモンクエスト画像/レジエレキ2.jpg", "bodytype1": "でんき", "bodytype2": "null", "skill1": 145, "skill2": 96, "skill3": 88, "skill4": 131, "F": "トランジスタ", "heavy": 145, "color1": "#FFE000", "color2": "#FFFFFF", "Fdp": "でんきタイプの技の威力が上がる"},
 {"id": 10, "name": "レジドラゴ", "level": 50, "MHP": 275, "HP": 275, "A": 120, "B": 70, "C": 120, "D": 70, "S": 0, "img1": "../準ポケモンクエスト画像/レジドラゴ1.jpg", "img2": "../準ポケモンクエスト画像/レジドラゴ2.jpg", "img": "../準ポケモンクエスト画像/レジドラゴ1.jpg", "bodytype1": "ドラゴン", "bodytype2": "null", "skill1": 146, "skill2": 138, "skill3": 12, "skill4": 147, "F": "りゅうのあぎと", "heavy": 200, "color1": "#4954A9", "color2": "#FFFFFF", "Fdp": "ドラゴンタイプの技の威力が上がる"},
];